{"id":3654,"date":"2014-02-08T21:31:42","date_gmt":"2014-02-08T16:01:42","guid":{"rendered":"http:\/\/howtodoinjava.com\/?p=3654"},"modified":"2022-07-16T14:48:30","modified_gmt":"2022-07-16T09:18:30","slug":"10-life-lessons-i-have-learned-in-last-few-years","status":"publish","type":"post","link":"https:\/\/howtodoinjava.com\/resources\/10-life-lessons-i-have-learned-in-last-few-years\/","title":{"rendered":"10 Life Lessons I have Learned in the Last Few Years"},"content":{"rendered":"\n<p>With you guys, I have always talked about technical things in Java technology in this blog. Today, I want to break the rule and share my learning on the personal and professional front. I am sharing my thoughts because I want\/hope you guys take little things seriously, which matter a lot in life.<\/p>\n\n\n\n<p>Believe me, when I decided to write this post, many things came to my mind that I wanted to include in this post but couldn&#8217;t do. I want this post to keep simple and in limit so that it does not lose its focus on what is most important and it&#8217;s intended to make you &#8216;pause and think for a few minutes.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-default\"><p>&#8220;Life is a journey and it could be understood only backwards; but it must be lived forward.&#8221;<\/p><\/blockquote>\n\n\n\n<p>Assuming my most friends through this blog are java professionals, most of us live two lives every day. One is personal when we are at home and the second when we are at work with different rules and environments, which we got outside employment. I will share my learnings on both fronts. I will start with my personal life because it requires more attention and is most often neglected.<\/p>\n\n\n\n<h2 id=\"h-5-life-lessons-for-personal-life\">5 Life Lessons for <span style=\"text-decoration: underline;\">Personal Life<\/span><\/h2>\n\n\n\n<h3 id=\"h-1-our-habits-shape-our-lives-choose-them-carefully\">1. Our habits shape our lives. Choose them carefully.<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft\"><img loading=\"lazy\" width=\"300\" height=\"225\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/habits.jpg\" alt=\"habits\" class=\"wp-image-3657\"\/><\/figure><\/div>\n\n\n<p>This lesson has been the best learning for me. We usually do not think about things, we repeatedly do in our daily life. And most of us do not realize that most of the things which we do every day become our habits. These everyday activities are sometimes good and sometimes bad. All of them become habits one day, whether you know it or not. While good habits will shape your future in positive ways, bad habits will bring you harm from multiple dimensions. Choose your habits carefully and support good habits. Fight bad habits if you already got them.<\/p>\n\n\n\n<p>The best way to determine if a habit is good or bad is straightforward, an honest analysis by you only. Take a pen and paper, and list down things you do everyday. Analyze them and their long time effects. Choose what&#8217;s good for you and what is not. Make a bold decision and take control of these things.<\/p>\n\n\n\n<p>At the start, you will find that it is challenging to change a habit. Here, I got some advice for you. If I remember it correctly, it is from &#8220;You can win&#8221; by Shiv Khera. I&nbsp; do not remember the exact words, but I remember the intent.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-default\"><p>&#8220;If you want to control your everyday bad habits, just delay them as much as you can. Soon they will not be there.&#8221;<\/p><cite><em>You Can Win<\/em> by <em>Shiv Khera<\/em><\/cite><\/blockquote>\n\n\n\n<p>For example, if you have a bad habit of smoking, try to delay the for 1 hour then 2 hours or more, depending on your regular timings. Then increase this delay even more. Sooner you will find that you can avoid it for many days. You actually got your control back. The fight is easier from here.<\/p>\n\n\n\n<p>This approach can be applied to any bad habit. Take pen and paper. Start now.<\/p>\n\n\n\n<h3 id=\"h-2-honesty-is-the-best-policy\">2. Honesty is the best policy.<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright\"><img loading=\"lazy\" width=\"300\" height=\"276\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/honesty-300x276.jpg\" alt=\"honesty\" class=\"wp-image-3658\" srcset=\"https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/honesty-300x276.jpg 300w, https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/honesty.jpg 400w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/figure><\/div>\n\n\n<p>This lesson is the second major step towards a rewarding life. Be honest. Appreciate honesty. Value Honesty. It is the best thing you can offer to your employer, friends, and everyone you care about. Now the question is, honesty in what, how and why?<\/p>\n\n\n\n<p>There is an old saying that we should always tell the truth, so we don&#8217;t have to remember what we said. Also, how you will feel when you know that person you deal with is not honest. This feeling is the same for others. Just think about it.<\/p>\n\n\n\n<p>A cross argument can be made that some job requires you to tell one or two lies, especially, marketing. Seriously? Do you think that the truth will be hidden all the time? The truth will not come out? Any profession lives on trust, and trust comes from honesty. This trust is actually converted to profits. More trust and more rewards. Think again. What if you get fake currency in return? Will you say it then also, that couple of lies are OK?<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-default\"><p>&#8220;Honesty is the best policy because no matter how good you are at telling lies, the truth will always come out.&#8221;<\/p><\/blockquote>\n\n\n\n<h3 id=\"h-3-your-family-and-friends-are-the-best-you-got-preserve-them-with-all-your-heart\">3. Your family and friends are the best you got. Preserve them with all your heart<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft\"><img loading=\"lazy\" width=\"300\" height=\"146\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/family-and-friends-300x146.png\" alt=\"family-and-friends\" class=\"wp-image-3659\" srcset=\"https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/family-and-friends-300x146.png 300w, https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/family-and-friends.png 400w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/figure><\/div>\n\n\n<p>Life is all about little things that happen to you when you are planning for big things. These little things are mostly attached to your family and friends and consist of moments you spend with them, and cherish with them. <\/p>\n\n\n\n<p>Most of you will agree with this, so I will not make the discussion long. I will revisit a quote here:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-default\"><p>&#8220;I&nbsp;hope everybody could get&nbsp;rich and famous and&nbsp;<em>will<\/em>&nbsp;have everything&nbsp;they&nbsp;ever dreamed of,&nbsp;so they will know&nbsp;that its&nbsp;<em>not<\/em>&nbsp;the&nbsp;<em>answer<\/em>.&#8221;<\/p><cite>Jim Carrey<\/cite><\/blockquote>\n\n\n\n<h3 id=\"h-4-a-day-you-didn-t-have-a-good-laugh-is-a-day-wasted\">4. A day you didn&#8217;t have a good laugh is a day wasted.<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright\"><img loading=\"lazy\" width=\"300\" height=\"169\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/a-good-laugh-300x169.jpg\" alt=\"a-good-laugh\" class=\"wp-image-3660\" srcset=\"https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/a-good-laugh-300x169.jpg 300w, https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/a-good-laugh.jpg 601w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/figure><\/div>\n\n\n<p>A good laughter is the best medicine. It has no side effects and brings lots of positive energy. Positive energy helps you in facing challenging circumstances. In fact, I got a big funny bone. I love to laugh and smile all the time. <\/p>\n\n\n\n<p>People who know me personally know it very well. I like humor and appreciate it also, provided it does not play with somebody&#8217;s emotions.<\/p>\n\n\n\n<h3 id=\"h-5-be-kind-do-something-for-less-fortunates\">5. Be kind. Do something for less fortunates.<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft\"><img loading=\"lazy\" width=\"300\" height=\"109\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/charity-300x109.jpg\" alt=\"charity\" class=\"wp-image-3662\" srcset=\"https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/charity-300x109.jpg 300w, https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/charity.jpg 1002w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/figure><\/div>\n\n\n<p>Don&#8217;t you feel that you are the beloved creation of GOD and GOD has been very kind to give you a very comfortable life? You got a good amount of fun in childhood, you got a fair chance to struggle in adulthood, and you got a job in some MNC or a good company. When I look back at my early days, we didn&#8217;t have so much to spend as we have today, but we never slept hungry. It&#8217;s a huge thing, guys. We are few among the most fortunate people in this world. We must respect this fact and remember it all the time.<\/p>\n\n\n\n<p>It also means that we must care about less fortunate people. They are forced to sleep hungry. They have to struggle in every step to survive the battle of life. Unfortunately, world-wise, the percentage of these less fortunates is much higher than people like us, who got a comparatively easy life. <\/p>\n\n\n\n<p>We must share what we got in our life. At the end of the day, the fact that matters is how many lives you changed or touched. If you changed none, you wasted your life.<\/p>\n\n\n\n<p>There are other things in my personal life, and I will share them in the future if time allows.<\/p>\n\n\n\n<h2 id=\"h-5-life-lessons-for-professional-life\">5 Life Lessons for <span style=\"text-decoration: underline;\">Professional Life<\/span><\/h2>\n\n\n\n<h3 id=\"h-1-hard-work-always-pays-never-ever-give-up-your-dreams\">1. Hard work always pays. Never ever give up your dreams.<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright\"><img loading=\"lazy\" width=\"231\" height=\"218\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/hard-work.jpg\" alt=\"hard-work\" class=\"wp-image-3663\"\/><\/figure><\/div>\n\n\n<p>Nothing pays like hard work. It always yields an enormous fortune. All you need is patience and more hard work. I ardently believe in the quote of Thomas Edison:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-default\"><p>&#8220;Genius is 1% inspiration, 99% perspiration.&#8221;<\/p><cite>Thomas Edison<\/cite><\/blockquote>\n\n\n\n<p>This hard work should also be directed towards any particular goal. That goal is your dream. Always dream big. Do not be scared of obstacles. Hard work is the basis for everything worthwhile you will achieve in life. There&#8217;s no easy way to do hard work. You have to find your passion,<em> stay focused and keep at the task until the job is done. You have to stay obsessively motivated.<\/em><\/p>\n\n\n\n<p>I have worked very hard to make this blog. It&#8217;s not among the top blogs globally, but it surely is on the right track. In the short time of one year, it is ranked much above many old established blogs. It has brought a lot of attention from quality minds towards me, my work and has got some money also ;-). I always knew that hard work pays, but now I believe it also.<\/p>\n\n\n\n<h3 id=\"h-2-learn-anything-new-everyday-make-everyday-count\">2. Learn anything new everyday. Make everyday count.<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft\"><img loading=\"lazy\" width=\"300\" height=\"168\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/learn-something-new-everyday.jpg\" alt=\"learn something new everyday\" class=\"wp-image-3664\"\/><\/figure><\/div>\n\n\n<p>This has been my motto of life for a long time, especially since I started blogging. I specifically search for topics that I do not know about. I create a list of such topics and try to learn them as much as possible. At least one topic per day. Being a human, sometimes I skip it, but I always try to clear this backlog with more speed only. You can also try this at your own pace.<\/p>\n\n\n\n<p>Please do not confuse here with only tech-related items. You can find something in your personal life such as your hobby or your creativity. Anything new. e.g., making a particular dish, learning a new magic trick or reading everything about a fantastic app. You can put anything on this list.<\/p>\n\n\n\n<p>So far, for me, the rewards have been much more than my expectations. I have got a lot of confidence in the workplace. I have never failed in any technical interview in the last few years. <\/p>\n\n\n\n<p>That&#8217;s a fascinating thing for many people. Well, I achieved it just by following this simple rule. Try yourself.<\/p>\n\n\n\n<h3 id=\"h-3-we-are-better-when-we-are-connected-make-connections\">3. We are better when we are connected. Make connections.<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright\"><img loading=\"lazy\" width=\"300\" height=\"224\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/make-connections-300x224.png\" alt=\"make-connections\" class=\"wp-image-3665\" srcset=\"https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/make-connections-300x224.png 300w, https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/make-connections.png 448w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/figure><\/div>\n\n\n<p>This lesson is actually the slogan in &#8216;<em>Bank of America<\/em>&#8216;, my past employer. But this fact I had learned much before joining the bank. You must have heard that Man is a social animal. If you want to grow in professional life, make contacts and keep them alive. These connections will help you when you are stuck in complex situations. You can get more growth opportunities because you are the one everybody knows.<\/p>\n\n\n\n<p>Here, I am not recommending any kind of flattering to anybody. Flattering, though, succeeds sometimes, but not in the long run. All I am asking is to socialize. <\/p>\n\n\n\n<p>Learn about family members of your colleagues. Talk about them. Make offline conversations personal. Make colleagues your friends. Do not ping them always for meetings. Ask them to have a cup of tea in the cafeteria. The same goes for your clients. Log into meetings 10 minutes before the start, and if they are available, talk to them about their family, their culture, their festivals or anything you can think of. <\/p>\n\n\n\n<p>All such things transform into a large number of connections you will have in the industry.<\/p>\n\n\n\n<h3 id=\"h-4-never-hesitate-to-ask-questions-make-active-participation-in-meetings\">4. Never hesitate to ask questions. Make active participation in meetings.<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft\"><img loading=\"lazy\" width=\"263\" height=\"192\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/Ask-questions.jpg\" alt=\"Ask-questions\" class=\"wp-image-3666\"\/><\/figure><\/div>\n\n\n<p>I have been a lazy person at starting of my career. I was also very shy because of various reasons. Whenever team meetings happened at that time, I was almost quiet in all of them. Sometimes I had questions, but I hesitated to ask them. You know what, they never got answered. Any question you never ask will never get answered. As simple as it is.<\/p>\n\n\n\n<p>The opportunities I lost at that time, I still can remember easily because they were just too bright to lose. I lost them. But, I will never make the same mistake in the future. Actually, I have improved a lot in this area.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-default\"><p>Gain confidence. Always have a word in team meetings, seminars or townhalls. Make your presence noticed.<\/p><\/blockquote>\n\n\n\n<h3 id=\"h-5-communication-skills-are-your-best-weapons-sharp-them-everyday\">5. Communication skills are your best weapons. Sharp them everyday.<\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright\"><img loading=\"lazy\" width=\"300\" height=\"158\" src=\"\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/comm-skills-300x158.gif\" alt=\"comm-skills\" class=\"wp-image-3668\"\/><\/figure><\/div>\n\n\n<p>Most of you agree that English the most dominating language for various reasons. I respect my mother tongue, &#8216;Hindi&#8217;, very much and prefer to talk about my personal life. But I can easily say that English is more important for making a rewarding life in our industry. English is a de-facto global language. Your work responsibilities require you to communicate with people from different cultures, and languages. English fills the gap. So if you want to communicate with them, master the language. Once you master the language, more opportunities come in your way.<\/p>\n\n\n\n<p>Please note that when I am saying English is important, it means a good command of the English language. You should communicate effectively. You should have a good command of vocabulary also. It is the first step towards the above four lessons too. It can put a lot of confidence in you to succeed on the above four points as well.<\/p>\n\n\n\n<p>There have been other things, which I wanted to talk about, but leaving them for now to limit this post.<\/p>\n\n\n\n<p>I will appreciate it if you share your thoughts with us. I want to know about you as well.<\/p>\n\n\n\n<p>Happy Learning !!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Life is about little things that happen while planning for big things. Let us discuss those little things having a major impact on our future.<\/p>\n","protected":false},"author":2,"featured_media":3656,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[976],"tags":[570,571],"uagb_featured_image_src":{"full":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/life-lessons-home-e1436092326446.jpg",431,287,false],"thumbnail":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/life-lessons-home-e1436092326446-150x150.jpg",150,150,true],"medium":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/life-lessons-home-e1436092326446-300x200.jpg",300,200,true],"medium_large":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/life-lessons-home-e1436092326446.jpg",431,287,false],"large":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/life-lessons-home-e1436092326446.jpg",431,287,false],"1536x1536":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/life-lessons-home-e1436092326446.jpg",431,287,false],"2048x2048":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/life-lessons-home-e1436092326446.jpg",431,287,false],"yarpp-thumbnail":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/02\/life-lessons-home-e1436092326446.jpg",120,80,false]},"uagb_author_info":{"display_name":"Lokesh Gupta","author_link":"https:\/\/howtodoinjava.com\/author\/lokeshgupta1981\/"},"uagb_comment_info":59,"uagb_excerpt":"Life is about little things that happen while planning for big things. Let us discuss those little things having a major impact on our future.","_links":{"self":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/posts\/3654"}],"collection":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/comments?post=3654"}],"version-history":[{"count":0,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/posts\/3654\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/media\/3656"}],"wp:attachment":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/media?parent=3654"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/categories?post=3654"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/tags?post=3654"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}