{"id":4050,"date":"2014-07-14T18:57:56","date_gmt":"2014-07-14T13:27:56","guid":{"rendered":"http:\/\/howtodoinjava.com\/?p=4050"},"modified":"2021-11-11T11:49:30","modified_gmt":"2021-11-11T06:19:30","slug":"best-way-to-learn-java","status":"publish","type":"post","link":"https:\/\/howtodoinjava.com\/resources\/best-way-to-learn-java\/","title":{"rendered":"Best Way to Learn Java Programming"},"content":{"rendered":"\n<p>Every month, I am asked the same question by many blog visitors (<em>primarily<\/em> beginners) about <strong>learning Java<\/strong>. <\/p>\n\n\n\n<p>I am writing this post dedicated to all my young fellows (<em>or I should say beginner<\/em>s) who want to attain a certain level of proficiency in Java technology and where they would like to take my advice. <\/p>\n\n\n\n<p>If you do not like my suggested way to learn Java, ignore this post and continue with what suits you best. Even better, suggest to others what you think is better to learn Java fast or quickly.<\/p>\n\n\n\n<p>Lets start by listing first thing first. Make sure you have prepared your Java development environment, i.e., You have installed JDK\/JRE and an IDE like Eclipse.<\/p>\n\n\n\n<h2>1. Learn the Language Basics<\/h2>\n\n\n\n<p>This is the first step for a self-evident reason. If you don&#8217;t know the basics, you will never know what to do next or what you are doing wrong. <\/p>\n\n\n\n<p>Initially, I do not expect you to become the master of all basic java concepts like keywords, core concepts or basic coding techniques. What I expect from you is just to read all the text available in the below links, even if it just doesn&#8217;t make sense to you in the first attempt. Just keep reading it.<\/p>\n\n\n\n<ol><li><a title=\"nutsandbolts\" href=\"https:\/\/docs.oracle.com\/javase\/tutorial\/java\/nutsandbolts\/\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/docs.oracle.com\/javase\/tutorial\/java\/nutsandbolts\/<\/a><\/li><li><a href=\"https:\/\/howtodoinjava.com\/java\/basics\/java-tutorial\/\">Java Tutorial<\/a><\/li><\/ol>\n\n\n\n<p>Please keep in mind that the above two links are not the only links for basic knowledge. You can <em>do a quick google search<\/em> and find out many similar links.<\/p>\n\n\n\n<p>When you are done with a few links as the two above, re-read them again the second time. Please don&#8217;t skip any part of it. This time, things will start making more sense to you, and you will be able to connect between various concepts by yourself. <\/p>\n\n\n\n<p>If you can still not connect the pieces of information spread in multiple places, keep repeating this step until you start relating the core concepts. Don&#8217;t worry about you are wrong or right; connect them, and better make notes. Notes will help you to measure your <em>java learning curve<\/em>.<\/p>\n\n\n\n<p>Carefully learn <a href=\"https:\/\/howtodoinjava.com\/java\/oops\/object-oriented-programming\/\">object-oriented programming concepts<\/a>. Just like other popular programming languages, Java is also an object-oriented programming language.<\/p>\n\n\n\n<h2>2. Start to Code with Small Programs<\/h2>\n\n\n\n<p>Once you are confident that you are familiar with the essential keywords and concepts and can relate them somehow, you are welcome to the second step. Here you will have to start writing some fundamental java programs e.g., hello world, simple addition and subtraction etc.<\/p>\n\n\n\n<p>When writing the programs, keep in mind that the first couple of programs will be adamant for you. But once you are done with them, you will not face a similar level of difficulty in the next set of programs.<\/p>\n\n\n\n<p>You may face difficulty so much that you may not be able to type in your hello world program, all by yourself. Don&#8217;t hesitate, open Google and search for similar programs. <\/p>\n\n\n\n<p>Remember. Don&#8217;t copy and paste the programs from any source or webpage. Just read the program, and type it into your IDE yourself. Solve the compilation error caused by incorrect syntax you got while typing (basically, I assume that you will make mistakes in lowercase\/uppercase). If you are still not able to do it, then retake the help of Google. Google is your friend; <em>remember it.<\/em><\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-large\"><p>Do not copy and paste the programs into IDE. Type the program and solve all compilation and runtime errors, yourself.<\/p><\/blockquote>\n\n\n\n<p>Please do it for a couple of programs and remember that always try to create a program by yourself first and then use Google. I am giving below a list of basic java programs which you may consider for the beginning.<\/p>\n\n\n\n<ul><li>Display some text message.<\/li><li>Display a list of numbers (1 to 50) each in new line.<\/li><li>Find the max and min between two numbers.<\/li><li>Swapping between two numbers using any technique you know.<\/li><li>Build a calculator program able to add\/substract\/multiply and divide the numbers.<\/li><li>Create two classes (super class\/sub class) and practice method overloading and overriding concepts.<\/li><li>Create some programs involving array e.g. printing output in array format in console.<\/li><li>And so on&#8230;<\/li><\/ul>\n\n\n\n<p>The above programs give you a start and make you understand what I meant by basic programs. The list can be long, and I suggest you add more items to it and create programs for them. <\/p>\n\n\n\n<p>And remember, Google is your friend 🙂<\/p>\n\n\n\n<h2>3. Learn Java APIs and Write Few Complex Programs<\/h2>\n\n\n\n<p>When you are done with making most of the basic programs, and most importantly, you are comfortable creating such basic programs, jump to the next step. <\/p>\n\n\n\n<p>Here, I suggest you work hard on learning Java APIs inside <a href=\"https:\/\/howtodoinjava.com\/java-collections\/\">java collections<\/a> and <a href=\"https:\/\/howtodoinjava.com\/java-io-tutorial\/\">java IO<\/a>. Just start exploring various classes and interfaces involved in these APIs and start creating programs for them. <\/p>\n\n\n\n<p>Please note that you should <strong>always try to find an existing API<\/strong> for doing a particular task, and you should not be creating your logic here. Your goal is to familiarize yourself with these APIs, so always look for a solution within these APIs only.<\/p>\n\n\n\n<p>Again I am suggesting a few basic programs you can work on to start with. Later you can include more APIs and more such programs as much as you can.<\/p>\n\n\n\n<ul><li>Taking input from console and printing it<\/li><li>Reading a file from filesystem and printing it&#8217;s content in console<\/li><li>Creating a new file and writing some data onto it<\/li><li>Reading data from a URL and do some search on it&#8217;s content<\/li><li>Store elements in a list, and then iterate over it<\/li><li>Use HashMap to store random key-value pairs and iterate over it in multiple ways<\/li><li>Create some programs for searching and sorting over collection elements<\/li><li>And so on&#8230;<\/li><\/ul>\n\n\n\n<p>The more and more programs you build at this step, you will get more and more confidence. As soon as you are good at using these APIs, jump to the next section&#8217;s most essential and challenging task.<\/p>\n\n\n\n<h2>4. Create One Desktop Application and One Web Application<\/h2>\n\n\n\n<p>This step will give you the confidence needed to face any java interview and prove your mettle in Java-related discussions. <\/p>\n\n\n\n<p>The idea is simple. You have to decide on at least one java desktop\/GUI application (e.g., desktop calculator) and one web application (e.g., hospital management). And now, when you have the most basic knowledge at your hand, start exploring everything which you will need to build your two applications.<\/p>\n\n\n\n<p>Ask help from experts (I will also do my bit to help you), your experienced friends, colleagues and every person you know and who can help you. <\/p>\n\n\n\n<p>Read all available good material that comes your way when searching for solutions and learning the concepts. Buy some books which are related to the concepts where you are stuck in. Do everything that is needed to build these applications. Make them your sole objective for a few days (or weeks or even months).<\/p>\n\n\n\n<p>Let me assure you that by the time you end up completing both exercises, you will be much more confident than ever before when it comes to Java. And more importantly, it helps you to develop a habit of getting things done at every cost. This attitude is very important in the long run of your career.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-large\"><p>This helps you build a habit of getting things done, at every cost.<\/p><\/blockquote>\n\n\n\n<h2>5. Participate in Good Java Blogs and Forums<\/h2>\n\n\n\n<p>After your above four steps are completed, you will be more of a confident man who can also help others like you were a few months back. <\/p>\n\n\n\n<p>Find people who know less and help them solve the problems, even if it requires some amount of time for you. A good place for these activities can be forums like <a href=\"http:\/\/stackoverflow.com\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">stackoverflow.com<\/a>. When you start learning about mistakes others are making, it just opens up your mind in various directions and improves your thought processing capabilities.<\/p>\n\n\n\n<p>In fact, the last step is like an infinite loop, and you should keep doing it when the time permits. You will appreciate the results when you will realize how mature you have become.<\/p>\n\n\n\n<p>That&#8217;s all for now on my thoughts regarding the best way to learn Java. If you happen to agree with me, drop a comment. If you disagree with me, drop your suggestion. I will include your thought in the main article if it&#8217;s really good.<\/p>\n\n\n\n<p>Happy Learning !!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every month, I am asked the same question by many blog visitors (primarily beginners) about learning Java. I am writing this post dedicated to all my young fellows (or I should say beginners) who want to attain a certain level of proficiency in Java technology and where they would like to take my advice. If &#8230; <a title=\"Best Way to Learn Java Programming\" class=\"read-more\" href=\"https:\/\/howtodoinjava.com\/resources\/best-way-to-learn-java\/\" aria-label=\"More on Best Way to Learn Java Programming\">Read more<\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[976],"tags":[623],"uagb_featured_image_src":{"full":false,"thumbnail":false,"medium":false,"medium_large":false,"large":false,"1536x1536":false,"2048x2048":false,"yarpp-thumbnail":false},"uagb_author_info":{"display_name":"Lokesh Gupta","author_link":"https:\/\/howtodoinjava.com\/author\/lokeshgupta1981\/"},"uagb_comment_info":26,"uagb_excerpt":"Every month, I am asked the same question by many blog visitors (primarily beginners) about learning Java. I am writing this post dedicated to all my young fellows (or I should say beginners) who want to attain a certain level of proficiency in Java technology and where they would like to take my advice. If&hellip;","_links":{"self":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/posts\/4050"}],"collection":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/comments?post=4050"}],"version-history":[{"count":0,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/posts\/4050\/revisions"}],"wp:attachment":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/media?parent=4050"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/categories?post=4050"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/tags?post=4050"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}