{"id":4371,"date":"2014-12-10T09:26:51","date_gmt":"2014-12-10T03:56:51","guid":{"rendered":"http:\/\/howtodoinjava.com\/?p=4371"},"modified":"2022-04-10T12:02:53","modified_gmt":"2022-04-10T06:32:53","slug":"how-java-io-works-internally","status":"publish","type":"post","link":"https:\/\/howtodoinjava.com\/java\/io\/how-java-io-works-internally\/","title":{"rendered":"How Java IO Works Internally?"},"content":{"rendered":"\n<p>This article is intended for readers who are curious to know <strong>how Java IO operations are mapped at the machine level<\/strong>; and what all things the hardware does all the time when your application is running.<\/p>\n\n\n\n<p>I am assuming that you are familiar with basic IO operations such as <a href=\"https:\/\/howtodoinjava.com\/java\/io\/java-read-file-to-string-examples\/\">reading a file<\/a>, and <a href=\"https:\/\/howtodoinjava.com\/java\/io\/java-write-to-file\/\">writing a file<\/a> through java IO APIs; because that is out of the scope of this post.<\/p>\n\n\n\t\t\t\t<div class=\"wp-block-uagb-table-of-contents uagb-toc__align-left uagb-toc__columns-1   uagb-block-2f1cd4dc \" \n\t\t\t\t\tdata-scroll= \"1\"\n\t\t\t\t\tdata-offset= \"30\"\n\t\t\t\t\tdata-delay= \"800\"\n\t\t\t\t>\n\t\t\t\t<div class=\"uagb-toc__wrap\">\n\t\t\t\t\t<div class=\"uagb-toc__title-wrap\">\n\t\t\t\t\t\t<div class=\"uagb-toc__title\">\n\t\t\t\t\t\t\tTable Of Contents\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t\t\t\t<div class=\"uagb-toc__list-wrap\">\n\t\t\t\t\t\t<ol class=\"uagb-toc__list\"><li class=\"uagb-toc__list\"><a href=\"#1-buffer-handling-and-kernel-vs-user-space\">1. Buffer Handling and Kernel vs User Space<\/a><li class=\"uagb-toc__list\"><a href=\"#2-virtual-memory\">2. Virtual Memory<\/a><li class=\"uagb-toc__list\"><a href=\"#3-memory-paging\">3. Memory Paging<\/a><li class=\"uagb-toc__list\"><a href=\"#4-fileblock-oriented-io\">4. File\/Block Oriented IO<\/a><li class=\"uagb-toc__list\"><a href=\"#5-file-locking\">5. File Locking<\/a><li class=\"uagb-toc__list\"><a href=\"#6-streams-io\">6. Streams IO<\/a><\/ol>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\n\n\n<h2 id=\"1-buffer-handling-and-kernel-vs-user-space\"><a name=\"buffer_handling\"><\/a>1. Buffer Handling and Kernel vs User Space<\/h2>\n\n\n\n<blockquote class=\"wp-block-quote is-style-default\"><p>The very term &#8220;input\/output&#8221; means nothing more than moving data in and out of buffers.<\/p><\/blockquote>\n\n\n\n<p>Buffers, and how buffers are handled, are the basis of all IO. Just keep this in your mind all the time.<\/p>\n\n\n\n<p>Usually, processes perform IO by requesting the operating system that data to be drained from a buffer (<em>write operation<\/em>) or that a buffer to be filled with data (<em>read operation<\/em>). That&#8217;s the whole summary of IO concepts.<\/p>\n\n\n\n<p>The machinery inside the operating system that performs these transfers can be incredibly complex, but conceptually, it&#8217;s very straightforward and we are going to discuss a small part of it in this post.<\/p>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter\"><img loading=\"lazy\" width=\"328\" height=\"99\" src=\"https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/12\/data-buffering-at-os-level.png\" alt=\"data buffering at os level\" class=\"wp-image-4372\" srcset=\"https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/12\/data-buffering-at-os-level.png 328w, https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/12\/data-buffering-at-os-level-300x90.png 300w\" sizes=\"(max-width: 328px) 100vw, 328px\" \/><\/figure><\/div>\n\n\n\n<p>The image above shows a simplified &#8216;logical&#8217; diagram of how block data moves from an external source, such as a hard disk, to a memory area inside a running process (e.g. RAM).<\/p>\n\n\n\n<ul><li>First of all, the process requests that its buffer be filled by making the <code>read()<\/code> system call.<\/li><li>Read call results in the kernel issuing a command to the disk controller hardware to fetch the data from disk.<\/li><li>The disk controller writes the data directly into a kernel memory buffer by <strong><a title=\"dma\" href=\"https:\/\/en.wikipedia.org\/wiki\/Direct_memory_access\" target=\"_blank\" rel=\"noopener noreferrer\">DMA<\/a><\/strong> without further assistance from the main CPU.<\/li><li>Once the disk controller finishes filling the buffer, the kernel copies the data from the temporary buffer in kernel space to the buffer specified by the process; when it requested the <code>read()<\/code> operation.<\/li><\/ul>\n\n\n\n<p>One thing to notice is that the kernel tries to cache and\/or prefetch data, so the data being requested by the process may already be available in kernel space. If so, the data requested by the process is copied out.<\/p>\n\n\n\n<p>If the data isn&#8217;t available, the process is suspended while the kernel goes about bringing the data into memory.<a name=\"virtual_memory\"><\/a><\/p>\n\n\n\n<h2 id=\"2-virtual-memory\">2. Virtual Memory<\/h2>\n\n\n\n<p>You must have heard of virtual memory multiple times already. Let me put some thoughts on it.<\/p>\n\n\n\n<p>All modern operating systems make use of virtual memory. Virtual memory means that artificial, or virtual, addresses are used in place of physical (hardware RAM) memory addresses.<\/p>\n\n\n\n<p>Virtual memory brings two important advantages:<\/p>\n\n\n\n<ol><li>More than one virtual address can refer to the same physical memory location.<\/li><li>A virtual memory space can be larger than the actual hardware memory available.<\/li><\/ol>\n\n\n\n<p>In the previous section, copying from kernel space to the final user buffer must seem like extra work. Why not tell the disk controller to send it directly to the buffer in userspace? Well, it is done using virtual memory and it&#8217;s advantage number <code>1<\/code> above.<\/p>\n\n\n\n<p>By mapping a kernel space address to the same physical address as a virtual address in user space, the DMA hardware (which can access only physical memory addresses) can fill a buffer that is simultaneously visible to both the kernel and a user-space process.<\/p>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter\"><img loading=\"lazy\" width=\"332\" height=\"155\" src=\"https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/12\/virtual-memory-architechture.png\" alt=\"virtual memory\" class=\"wp-image-4373\" srcset=\"https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/12\/virtual-memory-architechture.png 332w, https:\/\/howtodoinjava.com\/wp-content\/uploads\/2014\/12\/virtual-memory-architechture-300x140.png 300w\" sizes=\"(max-width: 332px) 100vw, 332px\" \/><\/figure><\/div>\n\n\n\n<p>This eliminates copies between kernel and userspace but requires the kernel and user buffers to share the same page alignment. Buffers must also be a multiple of the block size used by the disk controller (usually 512-byte disk sectors).<\/p>\n\n\n\n<p>Operating systems divide their memory address spaces into pages, which are fixed-size groups of bytes. These memory pages are always multiples of the disk block size and are usually powers of 2 (which simplifies addressing). Typical memory page sizes are 1,024, 2,048, and 4,096 bytes.<\/p>\n\n\n\n<p>The virtual and physical memory page sizes are always the same.<a name=\"memory_paging\"><\/a><\/p>\n\n\n\n<h2 id=\"3-memory-paging\">3. Memory Paging<\/h2>\n\n\n\n<p>To support the second advantage of virtual memory (having an addressable space larger than physical memory), it&#8217;s necessary to do virtual memory paging (often referred to as swapping).<\/p>\n\n\n\n<p>Memory Paging is a scheme whereby the pages of virtual memory space can be persisted to external disk storage to make room in physical memory for other virtual pages. Essentially, physical memory acts as a cache for a paging area, which is the space on the disk where the content of memory pages is stored when forced out of physical memory.<\/p>\n\n\n\n<p>Aligning memory page sizes as multiples of the disk block size allows the kernel to issue direct commands to the disk controller hardware to write memory pages to disk or reload them when needed.<\/p>\n\n\n\n<p>It turns out that all disk IO is done at the page level. This is the only way data ever moves between disk and physical memory in modern, paged operating systems.<\/p>\n\n\n\n<p>Modern CPUs contain a subsystem known as the <strong><a title=\"MMU\" href=\"https:\/\/en.wikipedia.org\/wiki\/Memory_management_unit\" target=\"_blank\" rel=\"noopener noreferrer\">Memory Management Unit (MMU)<\/a><\/strong>. This device logically sits between the CPU and physical memory. MMU contains the mapping information needed to translate virtual addresses to physical memory addresses.<\/p>\n\n\n\n<p>When the CPU references a memory location, the MMU determines which page the location resides in (usually by shifting or masking the bits of the address value) and translates that virtual page number to a physical page number (this is done in hardware and is extremely fast).<a name=\"block_io\"><\/a><\/p>\n\n\n\n<h2 id=\"4-file-block-oriented-io\">4. File\/Block Oriented IO<\/h2>\n\n\n\n<p>File IO always occurs within the context of a filesystem. A filesystem is a very different thing from a disk. Disks store data in sectors, which are usually 512 bytes each. They are hardware devices that know nothing about the semantics of files. They simply provide a number of slots where data can be stored. In this respect, the sectors of a disk are similar to memory pages; all are of uniform size and are addressable as a large array.<\/p>\n\n\n\n<p>On the other hand, a filesystem is a higher level of abstraction. Filesystems are a particular method of arranging and interpreting data stored on a disk (or some other random-access, block-oriented device). The code you write almost always interacts with a filesystem, not with the disks directly. It is the filesystem that defines the abstractions of file names, paths, files, file attributes, etc.<\/p>\n\n\n\n<p>A filesystem organizes (in hard disk) a sequence of uniformly sized data blocks. Some blocks store meta information such as maps of free blocks, directories, indexes, etc. Other blocks contain actual file data.<\/p>\n\n\n\n<p>The meta-information about individual files describes which blocks contain the file data, where the data ends, when it was last updated, etc.<\/p>\n\n\n\n<p>When a request is made by a user process to read file data, the filesystem implementation determines exactly where on disk that data lives. It then takes action to bring those disk sectors into memory.<\/p>\n\n\n\n<p>Filesystems also have a notion of pages, which may be the same size as a basic memory page or a multiple of it. Typical filesystem page sizes range from 2,048 to 8,192 bytes and will always be a multiple of the basic memory page size.<\/p>\n\n\n\n<p>How a paged filesystem performs IO boils down to the following logical steps:<\/p>\n\n\n\n<ol><li>Determine which filesystem page(s) (group of disk sectors) the request spans. The file content and\/or metadata on disk may be spread across multiple filesystem pages, and those pages may be non-contiguous.<\/li><li>Allocate enough memory pages in kernel space to hold the identified filesystem pages.<\/li><li>Establish mappings between those memory pages and the filesystem pages on disk.<\/li><li>Generate page faults for each of those memory pages.<\/li><li>The virtual memory system traps the page faults and schedules pageins (i.e. <em>paging-space page ins<\/em>) to validate those pages by reading their contents from disk.<\/li><li>Once the pageins have completed, the filesystem breaks down the raw data to extract the requested file content or attribute information.<\/li><\/ol>\n\n\n\n<p>Note that this filesystem data will be cached like other memory pages. On subsequent IO requests, some or all of the file data may still be present in physical memory and can be reused without rereading from disk.<a name=\"file_locking\"><\/a><\/p>\n\n\n\n<h2 id=\"5-file-locking\">5. File Locking<\/h2>\n\n\n\n<p>File locking is a scheme by which one process can prevent others from accessing a file or restrict how other processes access that file. While the name &#8220;file locking&#8221; implies locking an entire file (and that is often done), locking is usually available at a finer-grained level.<\/p>\n\n\n\n<p>File regions are usually locked, with granularity down to the byte level. Locks are associated with a particular file, beginning at a specific byte location within that file and running for a specific range of bytes. This is important because it allows many processes to coordinate access to specific areas of a file without impeding other processes working elsewhere in the file.<\/p>\n\n\n\n<p>File locks come in two flavors: <strong>shared<\/strong> and <strong>exclusive<\/strong>. Multiple shared locks may be in effect for the same file region at the same time. Exclusive locks, on the other hand, demand that no other locks be in effect for the requested region.<a name=\"stream_io\"><\/a><\/p>\n\n\n\n<h2 id=\"6-streams-io\">6. Streams IO<\/h2>\n\n\n\n<p>Not all IO is block-oriented. There is also stream IO, which is modeled on a pipeline. The bytes of an IO stream must be accessed sequentially. TTY (console) devices, printer ports, and network connections are common examples of streams.<\/p>\n\n\n\n<p>Streams are generally, but not necessarily, slower than block devices and are often the source of intermittent input. Most operating systems allow streams to be placed into non-blocking mode, which permits a process to check if the input is available on the stream without getting stuck if none is available at the moment. Such a capability allows a process to handle input as it arrives but perform other functions while the input stream is idle.<\/p>\n\n\n\n<p>A step beyond non-blocking mode is the ability to do <strong>readiness selection<\/strong>. This is similar to non-blocking mode (and is often built on top of non-blocking mode), but offloads the checking of whether a stream is ready for the operating system.<\/p>\n\n\n\n<p>The operating system can be told to watch a collection of streams and return an indication to the process of which of those streams are ready. This ability permits a process to multiplex many active streams using common code and a single thread by leveraging the readiness information returned by the operating system.<\/p>\n\n\n\n<p>Stream IO is widely used in network servers to handle large numbers of network connections. Readiness selection is essential for high-volume scaling.<\/p>\n\n\n\n<p>That&#8217;s all for this pretty complex topic having loads of technical words 🙂<\/p>\n\n\n\n<p>Happy Learning !!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn how Java IO operations are mapped at the machine level; and what all things the hardware does all the time when application is running.<\/p>\n","protected":false},"author":2,"featured_media":20207,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[19],"tags":[245,287],"uagb_featured_image_src":{"full":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2019\/03\/JAVA.jpg",750,425,false],"thumbnail":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2019\/03\/JAVA-150x150.jpg",150,150,true],"medium":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2019\/03\/JAVA-300x170.jpg",300,170,true],"medium_large":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2019\/03\/JAVA.jpg",750,425,false],"large":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2019\/03\/JAVA.jpg",750,425,false],"1536x1536":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2019\/03\/JAVA.jpg",750,425,false],"2048x2048":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2019\/03\/JAVA.jpg",750,425,false],"yarpp-thumbnail":["https:\/\/howtodoinjava.com\/wp-content\/uploads\/2019\/03\/JAVA-120x120.jpg",120,120,true]},"uagb_author_info":{"display_name":"Lokesh Gupta","author_link":"https:\/\/howtodoinjava.com\/author\/lokeshgupta1981\/"},"uagb_comment_info":8,"uagb_excerpt":"Learn how Java IO operations are mapped at the machine level; and what all things the hardware does all the time when application is running.","_links":{"self":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/posts\/4371"}],"collection":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/comments?post=4371"}],"version-history":[{"count":0,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/posts\/4371\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/media\/20207"}],"wp:attachment":[{"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/media?parent=4371"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/categories?post=4371"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/howtodoinjava.com\/wp-json\/wp\/v2\/tags?post=4371"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}